{"content":"<h3 id=\"buildagameofbattlingalienspaceshipsusingjavascript\">Build a game of battling alien spaceships using Javascript.</h3>\n<p>Earth has been attacked by a horde of aliens! You are the captain of the USS HelloWorld, on a mission to destroy every last alien ship.</p>\n<p>Battle the aliens as you try to destroy them with your lasers.</p>\n<p>There are six alien ships. The aliens' weakness is that they are too logical and attack one at a time: they will wait to see the outcome of a battle before deploying another alien ship. Your strength is that you have the initiative and get to attack first. However, you do not have targeting lasers and can only attack the aliens in order. After you have destroyed a ship, you have the option to make a hasty retreat.</p>\n<p><br>\n<br>\n<br></p>\n<h3 id=\"agameroundwouldlooklikethis\">A game round would look like this:</h3>\n<ul>\n<li><p>You attack the first alien ship</p></li>\n<li><p>If the ship survives, it attacks you</p></li>\n<li><p>If you survive, you attack the ship again</p></li>\n<li><p>If it survives, it attacks you again … etc</p></li>\n<li><p>If you destroy the ship, you have the option to <strong>attack</strong> the next ship or to <strong>retreat</strong></p></li>\n<li><p>If you retreat, the game is over, perhaps leaving the game open for further developments or options</p></li>\n<li><p>You win the game if you destroy all of the aliens</p></li>\n<li><p>You lose the game if you are destroyed</p></li>\n</ul>\n<p><br>\n<br>\n<br></p>\n<h3 id=\"shipproperties\">Ship Properties</h3>\n<ul>\n<li><p><strong>hull</strong> is the same as hitpoints. If hull reaches <code>0</code> or less, the ship is destroyed</p></li>\n<li><p><strong>firepower</strong> is the amount of damage done to the <strong>hull</strong> of the target with a successful hit</p></li>\n<li><p><strong>accuracy</strong> is the chance between 0 and 1 that the ship will hit its target</p></li>\n</ul>\n<p><strong>Your spaceship, the USS HelloWorld</strong> should have the following properties:</p>\n<ul>\n<li><strong>hull</strong> - <code>20</code></li>\n<li><strong>firepower</strong> - <code>5</code></li>\n<li><strong>accuracy</strong> - <code>.7</code></li>\n</ul>\n<p><strong>The alien ships</strong> should each have the following <em>ranged</em> properties determined randomly:</p>\n<ul>\n<li>hull - between <code>3</code> and <code>6</code></li>\n<li>firepower - between <code>2</code> and <code>4</code></li>\n<li>accuracy - between <code>.6</code> and <code>.8</code></li>\n</ul>\n<p>You could be battling six alien ships each with unique values.</p>\n<p>Example use of <strong>accuracy</strong> to determine a hit:</p>\n<pre><code class=\"javascript language-javascript\">if (Math.random() &lt; alien[0].accuracy) {\n    console.log('You have been hit!');\n}\n</code></pre>\n<p><br>\n<br>\n<br></p>\n<hr>\n<p><br>\n<br>\n<br></p>\n<h2 id=\"x1f47ewheretobegin\">&#x1F47E; Where to begin?</h2>\n<ul>\n<li><p>Read over the specifications. Make sure you understand them. If you do not understand them, try to clarify them for yourself.</p></li>\n<li><p>Plan the game. This is an act of simplification.</p></li>\n</ul>\n<p>From <a href=\"http://www.artima.com/weblogs/viewpost.jsp?thread=331531\">these programming principles</a></p>\n<ol>\n<li>Use <strong>pseudo code</strong> to get a sketch of your game first.</li>\n<li>Avoid Creating a <strong>YAGNI</strong> (You aren't going to need it) - You should not try to add functionality until you need it.</li>\n<li><strong>Do the simplest thing that could possibly work.</strong></li>\n</ol>\n<p>Often, beginning something is an act of <strong>creative inspiration</strong> to find the <strong>simplest possible case</strong>. The first step is not necessarily a matter of logical deduction. Once you have a few 'clues' you can follow the trail of crumbs to a logical conclusion.</p>\n<p><br>\n<br>\n<br></p>\n<h2 id=\"x1f47eactorsandthenactions\">&#x1F47E; Actors and then actions</h2>\n<p>A good rule of thumb is start with the <strong>actors</strong> and then the <strong>actions</strong>. What actors do we need? In this case, we need our spaceship and the alien spaceships. An action these ships can take is to attack something. Perhaps a ship object (an actor) could therefore have an <strong>attack</strong> method (an action).</p>\n<p>A repeating action in the game is that these ships attack each other until one of them has been destroyed. This might necessitate a loop or multiple loops.</p>\n<p><br>\n<br>\n<br></p>\n<h2 id=\"x1f47estartsimplerthantheinstructionssuggest\">&#x1F47E; Start simpler than the instructions suggest</h2>\n<p>Keep these five things in mind when planning and coding your game:</p>\n<ol>\n<li><p>Begin even simpler than the specifications suggest. In this case, perhaps just start with one alien ship instead of many alien ships, and get the code for one ship working first.</p></li>\n<li><p>Root out any 'gotchas' that you really ought to foresee. In this case, will we really want nested loops -- one for a battle, one for iterating over aliens)? How will we exit one loop and then exit the parent loop? Perhaps keeping it to one loop somehow will help us avoid unnecessary difficulties.</p></li>\n<li><p>When coding, form a solid and testable foundation before building upon it with more functionality. In this case, is there a bug where an alien can attack <em>after</em> it has been destroyed? Better fix that bug before increasing the complexity of the code.</p></li>\n<li><p>When you have a piece of functionality tested and working, <strong>commit it</strong>. Try not to commit broken code. Unsure of when to commit? <strong>Commit when something works</strong>. You want to save working code.</p></li>\n</ol>\n<p><br>\n<br>\n<br></p>\n<hr>\n<p><br>\n<br>\n<br></p>\n<h2 id=\"x1f47ecodequalityandcodesharing\">&#x1F47E; Code quality and code sharing</h2>\n<p>From the beginning, you will be writing your code <strong>for other developers.</strong></p>\n<p>Having to read and understand another developer's code is common practice. Get used to it now! In the 'real world', you will be in a position where you inherit someone else's code-base and are told to 'fix it' or to add a feature to the code.</p>\n<p>What does this mean for your coding practices?</p>\n<ul>\n<li>Use proper indentation! On the job, your code immediately fails a code review if indentation is not perfect.</li>\n<li>Use semantic variable and function names, and use a verb for your function/method names.</li>\n<li>What your code <strong>does</strong> should be self-evident.</li>\n<li>If a piece of code is hard to read have a comment above those few lines explaining what they do.</li>\n</ul>\n<p>Your code should be as coherent to another developer as possible.  </p>\n<p><br>\n<br>\n<br></p>\n<hr>\n<p><br>\n<br>\n<br></p>\n<h1 id=\"x1f680bonuses\">&#x1F680; Bonuses</h1>\n<ul>\n<li><p>The aliens send a random number of ships to attack Earth. Think of a reasonable range and implement it.</p></li>\n<li><p>Scientists have developed a super targeting computer for your lasers. You now are asked which of the aliens you would like to hit with your lasers.</p></li>\n<li><p>Scientists have improved your ship's shields. They don't work that consistently, and only improve your hit points by a random number each time</p></li>\n<li><p>Scientists have put missiles on your ship. You only have a limited number of them, but they do a lot of damage. You can say before each battle if you want to use one of your missles.</p></li>\n<li><p>The aliens have gained emotions and now can attack more than one at a time.</p></li>\n<li><p>Evil alien scientists have created an alien mega-ship. This mega-ship contains a number of \"weapon pods\" that each have their own individual hit points. These \"weapon-pods\" ( objects ) must all be destroyed before you can begin doing damage to the main ship, which also has its own hit points.</p></li>\n</ul>\n<p><br>\n<br>\n<br></p>\n<hr>\n<p><br>\n<br>\n<br></p>\n<h1 id=\"x1f680bonusbonuses\">&#x1F680; Bonus Bonuses</h1>\n<ul>\n<li><p>When the game is over, prompt the user if they would like to play again, and make it so the user can play again with all the values set back to default.</p></li>\n<li><p>So far the entire game is just one battle, with many aliens. Implement a game that consists of multiple battles where enemies respawn for a new battle at the end of the old battle. Keep track of points for the number of wins the player has.</p></li>\n<li><p>After every battle you are asked if you want to return to base and recharge your shields.</p></li>\n<li><p>Make the players and enemies stronger after each battle</p></li>\n<li><p>Distribute medals and power ups to the player depending on points</p></li>\n</ul>\n<p><br>\n<br>\n<br></p>\n<hr>\n<p><br>\n<br>\n<br></p>\n<h3 id=\"cheatcodesx2b06x2197x27a1\">Cheat codes &#x2B06; &#x2197; &#x27A1;</h3>\n<p><details><summary> 👈&nbsp;&nbsp;<b>Don't read these steps if you want to figure this out on your own.</b></summary></p>\n<p><br>\n<br>\n<hr>\nMake A Ship Class</p>\n<p>Make the Human Ship sub-class.</p>\n<p>Make an Alien Ship sub-class.</p>\n<p>Make an instance of each class</p>\n<p>Simulate a battle between your ship and a single alien ship first.</p>\n<p>Make a method for the USS HelloWorld that will attack a given target. The target can be an input to the method.</p>\n<p>Run the method and pass it the alien ship.</p>\n<p>Make it so the method reduces the target's hull by the firepower of the USS HelloWorld.</p>\n<hr>\n<p>Make a game object</p>\n<p>Make a method in the game object that will run a 'check win' for the health of the alien(s) and/or the USS HelloWorld. If the hull is 0 or less, display a message that the ship went kabloo-ey.</p>\n<p>Make it so the alien will only be hit if a Math.random call is below the accuracy threshold.</p>\n<p>Make a method for the alien ship to attack a target.</p>\n<p>At a status console log for the end of the round.</p>\n<p>PROBLEM: If you make the alien ship go kabloo-ey, then the alien should not then be able to  attack you. Fix this.</p>\n<p>Make it so the attacks will keep occuring until someone's hull is at 0. Isolate what it is that you want to repeat.</p>\n<hr>\n<p>Make many alien ships with a Class. Make each object slightly different . . .</p>\n<p>hull between 3 and 6, firepower between 2 and 4, accuracy between 0.6 and 0.8.</p>\n<p><strong>HUGE CLUE / ANSWER:</strong></p>\n<pre><code class=\"javascript language-javascript\">this.hull = Math.floor(Math.random() * 4) + 3;\nthis.firepower = Math.floor(Math.random() * 3) + 2;\nthis.accuracy = (Math.floor(Math.random() * 3) + 6) / 10;\n</code></pre>\n<p>Make a loop that calls the Class and generates alien ships. Push those constructed objects into a predefined array. Start with 6 ships (the loop should run 6 times).</p>\n<p>Try out the game with the first alien ship in the array.</p>\n<p>Run the battle with all ships in turn.</p>\n<hr>\n<p>Move functions into the game object.</p>\n<p>Move on to the bonuses.</p>\n<p><br></p>\n<hr>\n<p><i>These are just suggestions, not answers, and will change the nature of the game that you would have made had you not read these.</i></p>\n<p><br>\n<br></p>\n<hr>\n<p><br>\n<br></p>\n<p><b>✅&nbsp;&nbsp;Make the USS_HelloWorld object.</b></p>\n<p><b>✅&nbsp;&nbsp;Make a single alien ship object.</b></p>\n<p><b>✅&nbsp;&nbsp;Simulate a battle between your ship and a single alien ship first.</b></p>\n<p><b>✅&nbsp;&nbsp;Make a method for the USS HelloWorld that will attack a given target. The target can be an input to the method.</b></p>\n<p><b>✅&nbsp;&nbsp;Run the method and pass it the alien ship.</b></p>\n<p><b>✅&nbsp;&nbsp;Make it so the method reduces the target's hull by the firepower of the USS HelloWorld.</b></p>\n<hr>\n<p><b>✅&nbsp;&nbsp;Make a game object</b></p>\n<p><b>✅&nbsp;&nbsp;Make a method in the game object that will run a 'check win' for the health of the alien(s) and/or the USS HelloWorld. If the hull is 0 or less, display a message that the ship went kabloo-ey.</b></p>\n<p><b>✅&nbsp;&nbsp;Make it so the alien will only be hit if a Math.random call is below the accuracy threshold.</b></p>\n<p><b>✅&nbsp;&nbsp;Make a method for the alien ship to attack a target.</b></p>\n<p><b>✅&nbsp;&nbsp;At a status console log for the end of the round.</b></p>\n<p><b>🔴&nbsp;&nbsp;PROBLEM: If you make the alien ship go kabloo-ey, then the alien should not then be able to  attack you. Fix this.</b></p>\n<p><b>✅&nbsp;&nbsp;Make it so the attacks will keep occuring until someone's hull is at 0. Isolate what it is that you want to repeat.</b></p>\n<hr>\n<p><b>✅&nbsp;&nbsp;Make many alien ships with a Class. Make each object slightly different . . .</b></p>\n<p><b>✅&nbsp;&nbsp;Hull can be a random number between 3 and 6, firepower between 2 and 4, accuracy between 0.6 and 0.8.</b></p>\n<p><b>✅&nbsp;&nbsp;Make a loop that calls the Class and generates alien ships. Push those constructed objects into a predefined array. Start with 6 ships (the loop should run 6 times).</b></p>\n<p><b>✅&nbsp;&nbsp;Try out the game with the first alien ship in the array.</b></p>\n<p><b>✅&nbsp;&nbsp;Run the battle with all ships in turn.</b></p>\n<hr>\n<p><b>✅&nbsp;&nbsp;Move functions into the game object.</b></p>\n<p><b>🎉&nbsp;&nbsp;Move on to the bonuses&nbsp;&nbsp;🎉.</b></p>\n<p><br></p>\n<hr>\n<p></details></p>\n<p><br>\n<br>\n<br></p>\n<hr>\n<h3 id=\"extrafunstyletheconsole\">Extra fun: style the console</h3>\n<p>Output in Chrome console:</p>\n<p><img src=\"https://i.imgur.com/ehyNTL0.png\" alt=\"\" /></p>\n<p>You can use CSS in your Chrome console messages. Above is a simple example where messages are easier to differentiate.</p>\n<p>Formula, use <code>%c</code> in the first argument to console log, and provide CSS to the second argument:</p>\n<pre><code class=\"javascript language-javascript\">console.log('%c spacebattle', 'font-size: 40px');\n</code></pre>\n<p>Use multiple CSS properties:</p>\n<pre><code class=\"javascript language-javascript\">console.log('%c You have done ' + player.firepower + ' damage ', 'font-style: italic; background: azure; border: 1px solid grey;');\n</code></pre>","data":{"title":"SpaceBattle","subTitle":"An Introduction to the world","excerpt":"God is Good 3 appears on Index Page","featureImage":"/img/illustration-editor-desktop.svg","date":"10/21/21"},"isEmpty":false,"excerpt":"","path":"/Users/bigpoppacode/code/app_projects/pf-ms-md-blog/api/spacebattle.md","_id":"spacebattle"}