{"content":"<div id=\"about\">\n<h4>\n  Hello! I am Arthur Bernier Jr. I work as a Software Engineer specializing in JavaScript Technologies like Node, React and VueJs. I have a passion for helping businesses reach their perfect audience and using my skill to help them communicate to that audience in a way that makes them know, like and trust them.\n</h4>\n<br>\n<br>\n<h4>If your looking for a creative and knowledgable Software Engineering Leader? Search no further, because I am ready for the job.\nWith 10+ years of total Web Development experience, 5 years of experience as a full-time freelancer, and 4 Years of Start-Up Experience, a proven leader &amp; self starter as a military vet, former Senior Sailor of the Year (highest individual navy award for enlisted service-member), Presidential Service Award recipient, and sought after trainer, I can make an immediate impact on any team anywhere.\n<br>\n<br>\n<br>If you are seeking someone who is willing to learn multiple languages, is skilled at handling project deliveries, that is exactly what I am prepared to do and what I am known to excel at.<br>I am well versed in Full Stack JavaScript with React, Vue, Express, NodeJS, Sequelize, MongoDB, Gulp, Webpack, and Babel.\n<br>\n<br>\nI am familiar with Ruby, PHP, GoLang, Dart, C# and Python. I have extensive experience in WordPress and have worked with headless CMS's like CosmicJS. I am comfortable with working in the IOS App Development Environment, with React Native, Expo, and XCode. I am incredibly comfortable in a Linux Environment and am very familiar with Digital Ocean as well as AWS, and GCP. </h4></div>\n<p></div></p>\n<div class=\"card\" style=\"background:transparent!important; border: none;\">\n  <div>\n    <div>\n      <h2 class=\"card-title\">What People Are Saying...</h2>\n    </div>\n  </div>\n\n  <div class=\"jss177 jss176 \">\n  <!--\n  $ 'div', { className: 'card' }, =>\n    $ 'a', { href: \"/#{post._id}\" }, =>\n      $ 'h5', { className: 'card-header'}, post.data.title\n    $ 'div', { className: 'card-body' }, =>\n        $ 'h5', { className: 'card-title'}, post.data.subTitle\n        $ 'p', { className: 'card-text'}, post.data.excerpt\n\n\n        $ 'div',{ className: 'full-blog container'}, =>\n          $ 'div', { className: 'card' }, =>\n            $ 'a', { href: \"/#{post._id}\" }, =>\n              $ 'h2', { className: 'card-header'}\n            $ 'div', { className: 'card-body' }, =>\n                $ 'h2', { className: 'card-title'}, post.data.title\n                $ 'h5', { className: 'card-title'}, post.data.subTitle\n                $ 'div', { className: 'card-img-container'}, =>\n                  $ 'img', { className: 'card-img', src: post.data.featureImage, alt: post.data.title }\n                $ 'div', { className: 'container mx-auto', dangerouslySetInnerHTML: { __html: post.content }}\n  -->\n    <div class=\"card\">\n      <div class=\"card-header\">\n        <div class=\"card-img-container\">\n          <a href=\"#pablo\"><img class=\"card-img\" src=\"/img/evan.9318bdee.jpeg\" alt=\"...\"></a>\n        </div>\n      <div class=\"card-body\">\n        <h4 class=\"card-title\">Evan Lane</h4>\n        <div>\n          <h6 class=\"card-title\">Full Stack Web Developer &amp; Musician</h6>\n        </div>\n    <h5 class=\"container mx-auto\">\"Arthur is exceptionally friendly, knowledgable, and community-oriented. He is a driven worker who I feel especially fortunate to have studied with at General Assembly. Not only did Arthur excel in the immersive web development program, but he managed his time so well that he successfully completed freelance projects during the course and always made himself available to help others with their coursework. Just being around Arthur has inspired me to dig deeper in my own work.\"\n    </h5>\n    </div>\n    </div>\n    </div>\n\n    <div class=\"card\">\n    <div class=\"card-header\"><div class=\"card-img-container\">\n    <a href=\"#pablo\"><img class=\"card-image\" src=\"/img/girdle.de33f386.jpg\" alt=\"...\"></a></div>\n    <div class=\"card-body\">\n      <h4 class=\"card-title\">Daniel Girdle</h4>\n    <div>\n      <h6 class=\"card-title\" >Entrepreneur @ Millennial Business Owner Group</h6>\n    </div>\n    <h5 class=\"jss490\">\"I bought this gig because I needed an attractive website and Arthur delivered exactly what I needed. It’s rare you find someone who can take your idea to the next level but I promise if you trust this freelancer with your ideas he can develop what you need. \"</h5>\n    </div>\n    </div>\n    </div>\n\n    <div class=\"card\">\n    <div class=\"card-header\"><div class=\"card-img-container\">\n      <a href=\"#pablo\"><img class=\"card-img\" src=\"/img/tyler.26837006.jpeg\" alt=\"...\"></a>\n    </div>\n    <div class=\"card-body\">\n      <h4 class=\"card-title\" >Tyler Gosla</h4>\n    <div>\n      <h6 class=\"card-title\">Project Manager &amp; Military Veteran</h6>\n    </div>\n    <h5 class=\"jss490\">\"Working with Arthur will humble a person. He doesn’t showboat his quick whit or his ability to learn on the fly and he makes you wonder if he ever looses his patience. He can wear many hats and wears them well. Words can’t describe how impressive of a person Arthur is, but you’ll understand this recommendation when you get the chance to work with him.\"</h5>\n    </div>\n    </div>\n    </div>\n\n    <div class=\"card\">\n      <div class=\"card-header\"><div class=\"card-img-container\"><a href=\"#pablo\">\n      <img class=\"card-img\" src=\"/img/danny.cb9f92fc.jpeg\" alt=\"...\"></a></div>\n      <div class=\"card-body\">\n        <h4 class=\"card-title\">Daniel McKinney</h4>\n      <div>\n        <h6 class=\"card-title\">Full Stack Web Developer &amp; Sound Designer</h6>\n      </div>\n      <h5 class=\"jss490\">\"Arthur is a fantastic programmer and his energy lights up the room when he shows up. I was fortunate enough to work with him on a couple of group projects while at General Assembly, his work was always well thought out and executed. And he is always looking to push himself and his skills to the next level. His skills as a manager and helping a group stay on task are extremely effective. Arthur approaches this task not by micromanaging, but by being an open communicator, positive influence, and leading by example. His presence in the classroom at GA surely elevated my skills and attitude about the craft of programming, and my experience would not have been the same without him there.\"</h5>\n      </div>\n      </div>\n      </div>\n      </div>\n      </div>\n<p></div></p>","data":{"title":"About Me","subTitle":"'Technical Co-Founder and Head of Engineering at Seventh Ave. Inc   & SEI Instructional Lead at General Assembly'","excerpt":"This is the About Page","featureImage":"/img/profile.jpg","date":"10/21/21"},"isEmpty":false,"excerpt":"","path":"/home/bigpoppacode/code/bigpoppacode.io/api_static/about.md","_id":"about"}